//°è»êÀ» ÇÒ ¼ö ÀÖ´Â Å¬·¡½º
/*public class Calculator {
	
	
	int sum;   // 2°³ÀÇ Á¤¼ö°ªÀ» ´õÇÑ °ª
	double max;// ÃÖ´ë»óÇÑÄ¡ ÀÌ°ªº¸´Ù ´õ Å«°ªÀ» °è»êÇÒ ¼ö ¾ø´Ù´Â ¶æ, 100000.0
	
	
	
	//»ı¼ºÀÚ´Â Å¬·¡½º ¾È¿¡¼­ 1°³¶óµµ Á÷Á¢ ÀÛ¼ºÇÏ¸é ±âº»»ı¼ºÀÚ°¡ »ı¼ºµÇÁö ¾Ê°í 
	//»ı¼ºÀÚ¸¦ ÀÛ¼ºÇÏÁö ¾ÊÀ¸¸é ÀÚµ¿À¸·Î ±âº»»ı¼ºÀÚ°¡ »ı¼ºµÈ´Ù
   
	// ±âº»»ı¼ºÀÚ
	public Calculator() {
		max = 100000.0;
		
	}
	
	
	int sum;   // 2°³ÀÇ Á¤¼ö°ªÀ» ´õÇÑ °ª
	double max;// ÃÖ´ë»óÇÑÄ¡ ÀÌ°ªº¸´Ù ´õ Å«°ªÀ» °è»êÇÒ ¼ö ¾ø´Ù´Â ¶æ, 100000.0
	
	//Á¢±ÙÁöÁ¤ÀÚ ¸®ÅÏÅ¸ÀÔ ¸Ş¼Òµå¸í(¸Å°³º¯¼öµé)
	//2°³ÀÇ Á¤¼öÇü ¸Å°³º¯¼ö¸¦ ÀÔ·Â¹Ş¾Æ¼­ 
	//°ªÀ» ´õÇÑÈÄ¿¡ °á°ú°ªÀ» ¹İÈ¯ÇØÁÖ´Â ¸Ş¼Òµå
	//public int plus(int num1, int num2) {
		//sum = num1 + num2;
		//return sum;
		
		
		
		
		
		
	}
	
	//Ç×»ó Å«°ªÀ¸·Î ÀÛÀº°ªÀ» »©´Â°ÍÀ» ¿øÄ¢À¸·Î ÇÑ´Ù
	public int minus(int num1, int num2) {
		
		if (num1>num2) {
			sum = num1 - num2;
		}else {sum = num2 - num1;
			
		}
		
		// sum = num1 - num2;
		return sum; 
}
}*/
